STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_p2pRouter/STM32_WPAN/App/gatt_client_app.c
  /* USER CODE BEGIN GATT_CLIENT_APP_WriteCharacteristic_2 */

  /* USER CODE END GATT_CLIENT_APP_WriteCharacteristic_2 */

  return procClientContext.gatt_error_code;
}

/* USER CODE BEGIN LF */

static void P2Pclient_write_char(void)
{
  uint8_t index, indexRouter;
  tBleStatus ret;
  uint8_t writeValLen;
  uint32_t writeVal_addr;
  uint8_t *p_writeVal;
  uint16_t connHdlRouter;

  P2PR_getWriteData(&writeVal_addr, &writeValLen);
  p_writeVal = (uint8_t*)writeVal_addr;

  indexRouter = p_writeVal[0];
  connHdlRouter = P2PR_getConnHdlFromIndex(indexRouter);

  p_writeVal[0] = 0x01;

  for(index = 0 ; index < CFG_BLE_NUM_CLIENT_CONTEXTS ; index++)
  {
    if ((a_ClientContext[index].state == GATT_CLIENT_APP_CONNECTED) &&
        ((indexRouter == 0xFF) ||
         (a_ClientContext[index].connHdl == connHdlRouter)))
    {
      ret = aci_gatt_write_without_resp(a_ClientContext[index].connHdl,
                                        a_ClientContext[index].P2PWriteToServerValueHdl,
                                        writeValLen,
                                        p_writeVal);

      if (ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("aci_gatt_write_without_resp failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                a_ClientContext[index].P2PWriteToServerValueHdl);
      }
      else
      {
        LOG_INFO_APP("aci_gatt_write_without_resp success, connHdl=0x%04X, ValueHdl=0x%04X\n",
          a_ClientContext[index].connHdl,
          a_ClientContext[index].P2PWriteToServerValueHdl);
      }
    }
  }

  return;
}

/* USER CODE END LF */
